{ "id":"6_4_2020", 
"photocount": 1,
"title":"MCC Singapore Wins the Bid for the Mandai Rainforest Park South Project",
"date":"April 6, 2020",
"content":"On 6 April 2020, MCC Singapore was once again greeted with good news. After successfully winning the bid for the design and build contract for the Mandai Rainforest Park North project four months ago, MCC Singapore has won another bid and signed the contract with Mandai Park Development Pte Ltd for the design of the first stage of the Mandai Rainforest Park South project.\n\nThe Rainforest Park is an integral part of the entire Mandai Project and will be the world's first rainforest-themed park. The completed Mandai Project will form a large wildlife ecological area, comprising of the new Bird Park, Singapore Night Safari, Singapore Zoo, Singapore River Safari, and Rainforest Park. Experts have estimated that the annual number of visitors to Mandai will exceed 10 million, twice the current number, after the completion of the Rainforest Park.\n\nAdopting a new theme park format, the design of the Mandai Rainforest Park features animal habitats with elements of adventure and play, as well as wildlife rehabilitation centers, aviaries, and camping facilities. With the emphasis on conservation and sustainability, the design seeks to create a hub for nature education and research, leading Asia's development toward a natural ecological destination.\n\nRecently, the Singapore government has announced the temporary closure of all schools and non-essential business premises due to Covid-19, and MCC Singapore has strictly followed the rules and regulations imposed by the government to close down all construction sites, with all employees to work from home. This has not compromised or affected the design work for the Mandai Rainforest Park North project. The design team will continue to press ahead with the development of the project and strive to start construction as scheduled when work resumes in May. The design work for the Mandai Rainforest Park South project will also commence as soon as possible during the work-from-home period.\n\nMCC Singapore\nChen Luning"}