{
    "id": "6_4_2020",
    "photocount": 3,
    "author": "Chen Luning",
    "title": "MCC Singapore Wins the Bid for the Mandai Rainforest Park South Project",
    "titleCN": "中冶新加坡成功中标新加坡万礼热带雨林园南区项目",
    "date": "April 6, 2020",
    "contentCN": "2020年4月6日，中冶新加坡再次迎来喜讯，继4个月前顺利中标新加坡万礼热带雨林园北区设计施工总承包项目后，再夺一标，与万礼公园发展集团签署热带雨林公园南区第一阶段设计合同。\n\n热带雨林园（Rainforest Park）是整个万礼生态区的重要组成部分，也将成为世界上首个以热带雨林为主题的公园。建成后，万礼生态区将成为集新加坡动物园、夜间野生动物园、河川生态园、新的飞禽公园和热带雨林园为一体的大型野生生态区。有关专家估算，热带雨林园落成之后，万礼生态区的访客人数将会超过每年1000万人，比目前多一倍。\n\n作为全新的主题公园形态，万礼热带雨林园的设计重点包括带有冒险和游戏元素的动物栖息地、野生动物康复中心、鸟舍、露营设施等，强调保育和可持续性，意在打造一个自然教育和研究的枢纽，带领亚洲朝向自然生态的目的地发展。日前，新加坡政府因新冠肺炎疫情而宣布暂时关闭所有学校及非重要商业机构等，中冶新加坡严格按照政府指示关闭所有工地，公司全员居家办公。热带雨林公园北区的设计工作并未因此受到影响，设计团队將继续紧锣密鼓推动项目发展，争取在5月复工时按合约如期开工。热带雨林公园南区的设计工作也将在居家办公期间尽快展开。\n\n",
    "content": "On 6 April 2020, MCC Singapore was once again greeted with good news. After successfully winning the bid for the design and build contract for the Mandai Rainforest Park North project four months ago, MCC Singapore has won another bid and signed the contract with Mandai Park Development Pte Ltd for the design of the first stage of the Mandai Rainforest Park South project.\n\nThe Rainforest Park is an integral part of the entire Mandai Project and will be the world's first rainforest-themed park. The completed Mandai Project will form a large wildlife ecological area, comprising of the new Bird Park, Singapore Night Safari, Singapore Zoo, Singapore River Safari, and Rainforest Park. Experts have estimated that the annual number of visitors to Mandai will exceed 10 million, twice the current number, after the completion of the Rainforest Park.\n\nAdopting a new theme park format, the design of the Mandai Rainforest Park features animal habitats with elements of adventure and play, as well as wildlife rehabilitation centers, aviaries, and camping facilities. With the emphasis on conservation and sustainability, the design seeks to create a hub for nature education and research, leading Asia's development toward a natural ecological destination.\n\nRecently, the Singapore government has announced the temporary closure of all schools and non-essential business premises due to Covid-19, and MCC Singapore has strictly followed the rules and regulations imposed by the government to close down all construction sites, with all employees to work from home. This has not compromised or affected the design work for the Mandai Rainforest Park North project. The design team will continue to press ahead with the development of the project and strive to start construction as scheduled when work resumes in May. The design work for the Mandai Rainforest Park South project will also commence as soon as possible during the work-from-home period."
}