{ "id":"19_5_2020", 
"photocount": 2,
"title":"MCC Singapore Wins Bid for Short Street Hotel Project",
"date":"May 19, 2020",
"content":"On 19 May 2020, MCC Singapore, which was preparing for the resumption of construction in June, won the EPC contract for the Short Street Hotel project. MCC Singapore has once again broken new ground in the local construction market after winning the design and build contract for the Mandai Tropical Rainforest Park project.\n\nThe Short Street Hotel project covers an area of 2251 square meters, with a construction area of 11160 square meters, one basement level, 14 floors above ground, and a total of 528 guest rooms. The project was challenging due to the site's limited space which required demolition before construction, as well as the tight construction schedule. With the nearest building only one meter away, it required a high level of management for the site layout and the overall construction process. Besides, the complex surrounding and environment of the project, located near the MRT line and only five to six meters away from the heritage conservation area, raises new challenges. The construction plan for the excavation of the pit not only has to consider the impact on the deformation of the MRT tunnel, but also the protection of the surrounding heritage.\n\nMCC Singapore's extensive experience in working around MRT lines in previous projects, as well as the detailed analysis of the pile foundations and the corresponding treatment of possible collisions proposed in the tender scheme, won the client's approval. In addition, the project required a total construction period of 15 months for the entire project, from demolition to completion. After carefully studying the time required for each process of the entire project, the bidding team found that according to the existing structural form of the building, traditional construction methods could not meet the bidding time requirements. As a result, two construction options were submitted in the tender for the owner's choice: one based on the existing drawings, which was economical and reasonable but had a longer construction period while the other modified the structural form of the project and replaced it with a steel structure that could be constructed faster. The latter option considered the use of reverse engineering in the construction of the foundation to meet the schedule requirements. Ultimately, MCC Singapore won the tender by virtue of its rich construction experience and excellent problem-solving ability.\n\nChen Luning,\nMCC Singapore"}