{
    "id": "10/3/2021",
    "about": "Incorporated in 2010, MCC Land (Singapore) Limited has been actively involved in Singapore’s real estate scene and achieved good results. It has developed five development projects, co-developed two development projects and managed five development projects. The company has been ranked Singapore’s top 10 real estate developers for three consecutive years and won the “Asia’s Top Influential Brands” award.",
    "history": [
        {
            "year": 1992,
            "content": "Entered the Singapore market in response to China's \"Going Global Strategy\" "
        },
        {
            "year": 1997,
            "content": "The first overseas subsidiary, China Jingye Construction Engineering (Singapore) Pte Ltd was registered and established in Singapore to undertake local construction projects"
        },
        {
            "year": 2006,
            "content": "China Jingye Engineering Corporation Limited (Singapore Branch)was officially established with the ability to directly bid for projects and entered the ranks of general contractors"
        },
        {
            "year": 2007,
            "content": "The company was the appointed structural steel contractor for Resorts World Sentosa, becoming a renowned brand in the structural steel industry"
        },
        {
            "year": 2008,
            "content": "As the EPC contractor for the Universal Studios Singapore project, the company created a miracle in the history of Singapore's engineering construction in 18 months "
        },
        {
            "year": 2010,
            "content": "MCC Land (Singapore) Pte Ltd was established to undertake real estate development in Singapore and the surrounding regions for China Metallurgical Group Corporation. As the representative for the group's joint-stock company, it is also responsible for the business activities in Singapore. "
        },
        {
            "year": 2017,
            "content": "Transforming into an influential integrated urban operator, the company is leading the whole-industry-chain and process management of urban development. The company is not only involved in urban planning, land development, urban development, and urban governance but is also leading city infrastructure construction, as well as real estate-related industries and financial services to create a platform for mutually beneficial cooperation between the government and enterprises. "
        },
        {
            "year": "",
            "content": ""
        }
    ],
    "realEstate": {
        "description": "MCC Land (Singapore) was set up in 2010 and is committed to be one of the premier property developers in Singapore. Its motto is to strive to offer Singapore residents a superior lifestyle and better choice of homes. Its portfolio of luxury residential projects includes The Canopy, Canberra Residences, One Canberra, The Santorini, TRE Residences and the upcoming mixed-use development at Meyappa Chettiar Road comprising The POIZ Residences (residential) and The POIZ Centre (commercial). It is also the project manager for The Nautical, Forestville and Sea Horizon. As at October 2015, MCC Singapore has launched a total of 3,821 private condominium and executive condominium units*, on top of 2,451 units* in the pipeline that will be put to market in the next 12 months.\n\nWith its strong presence and a good understanding of the local market needs, MCC Singapore shares the public’s aspiration for better home and better lives.\n\n(Mcc Land) Real Estate Projects",
        "shortDescription": "MCC Land (Singapore) was set up in 2010 and is committed to be one of the premier property developers in Singapore. Its motto is to strive to offer Singapore residents a superior lifestyle and better choice of homes...",
        "queensPeak": {
            "name": "Queens Peak",
            "type": "Condominium For Sale",
            "tenure": "99-year Leasehold",
            "developer": "Mcc Land",
            "furnishing": "Partially Furnished",
            "top": "2020",
            "description": "Queen's Peak is a New Launch Luxury Condominium, located at Queenstown, Singapore. Developed by renowned developer HY Realty (Dundee) Pte. Ltd, and managed by MCC Land (S) Pte. Ltd, Queens Peak Condo comprises of twin towers, with a total of 736 luxurious residential units, complete with a Childcare Centre."
        }
    },
    "construction": {
        "shortDescription": "China Jingye Engineering Corporation Limited (Singapore Branch) is the only state-owned enterprise in Singapore to obtain the highest A1 grade in both General Building (CW01) and Civil Engineering (CW02) categories issued by the Building and Construction Authority of Singapore (BCA)...",
        "description": "China Jingye Engineering Corporation Limited (Singapore Branch) is the only state-owned enterprise in Singapore to obtain the highest A1 grade in both General Building (CW01) and Civil Engineering (CW02) categories issued by the Building and Construction Authority of Singapore (BCA).\n\nChina Jingye have attained the ISO 9001, ISO 14001, OHSAS 18001 and bizSAFE Star certifications and have accumulated a wealth of engineering and excellent performance in Singapore. It built a considerable number of Singapore's landmark projects such as Universal Studios Singapore, Maritime Experiential Museum, Singapore Expo and Keppel Distripark.\n\nChina Jingye has 20 years of development experience in Singapore. It has amassed comprehensive main contractor and engineering performance works and extensive experience in turnkey projects. It also has specialised contracting, supply and subcontracting works to add to the foray of portfolio. China Jingye builds on the core strengths of MCC Group in the design, fabrication and installation of steel structures. It is certified as a structural steel plant by BCA and Singapore Structural Steel Society (SSSS). The company is a corporate member of SSSS.\n\nIn the construction sector for public housing, China Jingye has been actively involved in the construction of numerous Housing and Development Board (HDB) projects in Singapore including lifts upgrading programmes. It is also responsible for the specialised structural steelworks of Singapore Expo, Keppel Distripark, Woodlands Checkpoint, terminals of the Port of Singapore Authority, Khoo Teck Puat Hospital and other large scale engineering projects.\n\nIn the construction sector for private properties, China Jingye's noteworthy turnkey projects include Universal Studios Singapore, Maritime Experiential Museum (Resorts World Sentosa) and the civil engineering work of Sentosa Adventure Cove Waterpark. The company is also responsible for the engineering, procurement and construction of 12 property development projects under MCC Land (Singapore) Limited. It is the appointed subcontractor for the 24,000-tonne structural steelworks of all famous attractions in Sentosa as well as the subcontractor for various projects including the large-scale oil terminal Universal Terminal, the large-scale food factory Gourmet East Kitchen, a large number of HDB flats and private condominiums, and MRT engineering works."
    }
}