{ "id":"6_9_2019", 
"photocount":6,
"title":"MCC Singapore Was Invited to Participate in the International Built Environment Week Exhibition",
"date":"SEPTEMBER 6, 2019",
"content":"MCC Singapore was invited to participate in the 2019 Singapore International Built Environment Week (IBEW), which was held on September 6 at Singapore bay sands convention and exhibition centre with the theme of \"Leading the Transformation of the Construction Industry\". \n\n9月3日至6日，新加坡海湾金沙会展中心举办了以 “引领建筑业转型” 为主题的2019年新加坡国际建筑环境周（IBEW），中冶新加坡也受邀参加了本次展会。\n\nIn this exhibition, MCC Singapore highlights two recent high-end projects in Cambodia. Sky Villa, MCC's first residential development in Phnom Penh, Cambodia; Another representative project is Dara Sakor on the southwest coast of Cambodia. The project is a model of Cambodia-China economic cooperation and a key project of \"the Belt and Road\". With eight functional areas including smart industrial park, commercial style street, cultural tourism area, overlooking the sea apartment, villa resort, yacht dock resort, coastal leisure resort and static sea bathing area as the core, aiming to create a new paradise for world-class tourism and vacation. \n Organized by the Building and Construction Authority of Singapore (BCA), this exhibition is the first comprehensive and influential event in the region, focusing on building sustainability, looking at the entire value chain of the built environment ecological cycle, and promoting the transformation of the construction industry worldwide. This event attracted more than 12,000 industry professionals to gather in The Lion City to discuss the new policies of the industry, grasp the new dynamics of the industry, insight into the new trends of the industry. At the same time, the exhibition gathered more than 550 well-known domestic and foreign famous brands, enabling suppliers to promote new products and technologies, spread the brand, and expand interpersonal resources. \n\n此次展会由新加坡建设局（BCA）主办，是区域内首个全面综合性建筑极具影响力的盛会，聚焦于建筑可持续性，放眼整个建筑环境生态周期价值链， 助推世界范围内的建筑业转型。本次盛会吸引了超过12000名业界人士汇聚狮城探讨行业新政，掌握行业新动态，洞察行业新趋势。 展会同时聚集了550多家海内外知名品牌，让供应商推广新产品新技术，传播品牌的同时，拓展人脉资源。\n\nMCC Singapore, as an overseas entity that has experienced all stages of development of a construction enterprise and now has its own team in each part of the industrial chain and has the ability to provide a complete value chain, will vigorously promote the governments and enterprises of China, Singapore and Cambodia “Going Global Jointly” and create a good cooperation and win-win platform for the governments and enterprises of the three countries. \n\n中国中冶新加坡作为经历了建筑企业全部发展阶段、目前也拥有产业链中每个环节的自有团队、有能力提供完整价值链的海外实体公司， 将大力推动中、新、柬三国政府和企业“联合走出去”，为三国的政府和企业创造良好的合作和共赢平台。 \n\nDuring the exhibition, the MCC Singapore booth hosted thousands of visitors from different industries such as construction, water conservancy and environment, and hosted the Cambodian Housing Development Association and the Saudi Chamber of Commerce Council members on the first and second day of the exhibition. Visitors showed great interest in the development of MCC Singapore's two key projects in Cambodia. The project leaders also gave detailed explanations and in-depth discussions on different projects. \n\n此次展会中，中冶新加坡展台接待了来自建筑、水利、环境等不同行业的上千名访客，并且在展会第一天和第二天分别接待了柬埔寨住房发展协会和沙特商会理事会成员。 访客们对中冶新加坡在柬埔寨两大重点项目开发展示出极大兴趣，各项目负责人也针对不同项目向大家进行详细地讲解和深入的讨论。"

}
