{
    "id": "7_9_2020",
    "photocount": 5,
    "title": "Cloud Signing Ceremony for Danga Heights Project held between MCC Singapore and Malaysia’s Iskandar Waterfront Holdings",
    "titleCN": "中冶新加坡与马来西亚依斯干达滨海控股举行Danga Heights项目云端签约仪式",
    "date": "September 7, 2020",
    "contentCN": "2020年9月7日上午，中冶新加坡与依斯干达滨海控股举行了马来西亚新山Danga Heights项目签约与项目公司成立仪式。\n\n本次签约仪式在马来西亚新山市、中国北京中冶建研院与中冶新加坡三个会场通过现场视频连线同步进行，并通过媒体对外进行现场直播。中冶建研院总经理、中冶新加坡总经理朱建国，柔佛州州务大臣拿督哈斯尼，中冶新加坡和依斯干达滨海控股有限公司代表等共同参加了签约仪式。\n\nDanga Heights项目位于马来西亚第二大城市——柔佛州州府新山市的依斯干达特区，靠近新山中央商务区，毗邻Skudai Highway (士古来快速公路)，项目整体占地约60万平方米，计划分4期开发，开发周期10-12年。\n\n当前，中冶置业新加坡公司正逐步从房地产投资和开发商向城市综合运营商转型。凭借自身丰富的城市规划实践经验、国际一流的工程开发和建设能力，以及项目全过程运营管理经验，为马来西亚Danga Heights项目制订了既具有前瞻性、国际化，又符合马来西亚本土发展的总体规划，以及启动区的详细规划设计方案，为项目的成功打下了坚实的基础。\n\nDanga Heights将成为新山最具发展潜力的大型综合性开发项目，借助马来西亚和新加坡两国签订2026年底通车的新柔地铁的合作机遇，在依斯干达地区打造一个 “国际化混合生态社区”。根据规划和功能定位，这个项目将成为马来西亚充满活力的电子商务、体验经济集中地；时尚共享、生态环保的优质生活圈；以及新山最具影响力的 5G应用智慧创新社区。\n\n作为该项目的合作开发商，中冶新加坡不仅肩负着工程总承包的任务，还参与了项目前期策划、规划设计、以及未来的运营与管理，将为Danga Heights以及依斯干达地区的美好未来尽一份力，用最优秀的团队和资源，高标准、高质量、高效率的完成Danga Heights的开发建设，为马来西亚新山的发展愿景增光添彩。",
    "content": "On the morning of September 7, 2020, MCC Singapore and Iskandar Waterfront Holdings held a signing ceremony for the Danga Heights project in Johor Bahru, Malaysia and for the establishment of the project company.\n\nThe signing ceremony was held simultaneously in Johor Bahru, Malaysia, MCC Central Research Institute of Building and Construction in Beijing, China, and MCC Singapore Headquarter through live video. The ceremony was also broadcasted live through the media and was attended by the General Manager of MCC Central Research Institute of Building and Construction and MCC Singapore Zhu Jianguo, Menteri Besar of Johor Datuk Ir Hasni Mohammad, as well as the representatives of MCC Singapore and Iskandar Waterfront Holdings.\n\nThe Danga Heights project is held in Iskandar’s special economic zone, located in the second largest city of Malaysia, the capital city of Johor State, close to the Johor Central Business District and adjacent to Skudai Highway. The overall project area is about 600,000 square meters and is planned to develop over four phases. The development cycle ranges between 10-12 years.\n\nCurrently, MCC Singapore is gradually transforming itself from a real estate investor and developer to an integrated city operator. With its rich experience in urban planning, world-class engineering development and construction capabilities, as well as its experience in the overall project operation and management, MCC Singapore has formulated a forward-looking and globalised master plan for the Danga Heights project that is in line with the local development of Malaysia. MCC Singapore has also produced a detailed design plan for Danga Heights, laying a solid foundation for the success of the project.\n\nDanga Heights will be one of the most promising large-scale mixed-use developments in Johor Bahru, leveraging on the JB-Singapore RTS Link—a joint project by Singapore and Malaysia that is expected to begin operations by end of 2026—to create an \"International Mixed-Use Eco-Community\". Following the plan and its functional positioning, the Danga Heights project would become a vibrant e-commerce and experience economy hub in Malaysia, a stylish and eco-friendly quality residential area, as well as one of the most influential smart community for 5G applications in Johor Bahru.\n\nAs the co-developer of the project, MCC Singapore is not only the EPC contractor, but is also involved in the pre-planning, planning and design, as well as the future operation and management of the project. Using the best team and resources to complete the project with high standards, quality, and efficiency, MCC Singapore seeks to contribute to the bright future of Danga Heights and the Iskandar region, as well as to help realise the vision of Johor Bahru, Malaysia.\n\n"
}