{ "id":"7_9_2020", 
"photocount": 5,
"title":"Cloud Signing Ceremony for Danga Heights Project held between MCC Singapore and Malaysia’s Iskandar Waterfront Holdings",
"date":"September 7, 2020",
"content":"On the morning of September 7, 2020, MCC Singapore and Iskandar Waterfront Holdings held a signing ceremony for the Danga Heights project in Johor Bahru, Malaysia and for the establishment of the project company.\n\nThe signing ceremony was held simultaneously in Johor Bahru, Malaysia, MCC Central Research Institute of Building and Construction in Beijing, China, and MCC Singapore Headquarter through live video. The ceremony was also broadcasted live through the media and was attended by the General Manager of MCC Central Research Institute of Building and Construction and MCC Singapore Zhu Jianguo, Menteri Besar of Johor Datuk Ir Hasni Mohammad, as well as the representatives of MCC Singapore and Iskandar Waterfront Holdings.\n\nThe Danga Heights project is held in Iskandar’s special economic zone, located in the second largest city of Malaysia, the capital city of Johor State, close to the Johor Central Business District and adjacent to Skudai Highway. The overall project area is about 600,000 square meters and is planned to develop over four phases. The development cycle ranges between 10-12 years.\n\nCurrently, MCC Singapore is gradually transforming itself from a real estate investor and developer to an integrated city operator. With its rich experience in urban planning, world-class engineering development and construction capabilities, as well as its experience in the overall project operation and management, MCC Singapore has formulated a forward-looking and globalised master plan for the Danga Heights project that is in line with the local development of Malaysia. MCC Singapore has also produced a detailed design plan for Danga Heights, laying a solid foundation for the success of the project.\n\nDanga Heights will be one of the most promising large-scale mixed-use developments in Johor Bahru, leveraging on the JB-Singapore RTS Link—a joint project by Singapore and Malaysia that is expected to begin operations by end of 2026—to create an \"International Mixed-Use Eco-Community\". Following the plan and its functional positioning, the Danga Heights project would become a vibrant e-commerce and experience economy hub in Malaysia, a stylish and eco-friendly quality residential area, as well as one of the most influential smart community for 5G applications in Johor Bahru.\n\nAs the co-developer of the project, MCC Singapore is not only the EPC contractor, but is also involved in the pre-planning, planning and design, as well as the future operation and management of the project. Using the best team and resources to complete the project with high standards, quality, and efficiency, MCC Singapore seeks to contribute to the bright future of Danga Heights and the Iskandar region, as well as to help realise the vision of Johor Bahru, Malaysia.\n\n"
}