{ "id":"2_10_2020", 
"photocount": 6,
"title":"MCC Singapore Celebrates Mid-Autumn Festival Online",
"date":"October 2, 2020",
"content":"On 2 October, following the success of the \"Dragon Boat Festival on the Clouds\" event in June earlier this year, MCC Singapore once again gathered online for a virtual celebration of the Mid-Autumn Festival. Just as how \"the bright moon never separates two places in its embrace,\" the virtual celebration connected MCC employees in China, Singapore, Cambodia, and Indonesia as we come together to celebrate and join in on the festivities while simultaneously promoting Chinese culture.\n\nAs the event commenced, all employees of MCC Singapore jointly watched the festive greetings and messages from Zhu Jianguo, General Manager of MCC Central Research Institute of Building and Construction (MCC CRIBC), as well as from other leaders and colleagues of MCC CRIBC in Beijing. While extending holiday wishes to the employees and their families, General Manager Zhu Jianguo affirmed the development and achievements of MCC Singapore in recent years. In the face of the current pandemic and the challenges it poses to the company, he stressed the need to \"firmly believe that both challenges and opportunities co-exist, and strive to overcome these difficulties and seek opportunities for development.\"\n\nAlong with the good news expecting Singapore to enter the third phase of reopening in a few weeks' time and anticipating an easing of restrictions on social activities, lanterns were hung up in the offices of MCC Singapore, creating a festive atmosphere. The employees of MCC Singapore gathered online from their respective workstations, offices, and homes. The employees in various project sites located in Cambodia and Indonesia also prepared traditional Chinese festive delicacies such as moon cakes and carried out activities online. As the winner of last year's competition, Mojumder Bakul kicked off this year's annual company event, MCC Voice, with exotic Bengali songs sung from the worker's dormitories in Kranji.\n\nIn light of the current pandemic, there were no fancy stages or audiences cheering below the stage for this year's MCC Voice, but it was still fun in another kind of way. Participants from various overseas projects, of different nationalities and cultural backgrounds acted as 'anchor-men' in front of the camera, singing passionately. Besides the familiar Chinese songs, there were also Indonesian and Bengali songs showcasing their distinctive charms, making this year's virtual Mid-Autumn Festival celebration a special and memorable one. In addition to the spectacular MCC Voice event, the celebration was also interspersed with various traditional Chinese games such as the Lantern Riddles activity.\n\nThese various activities not only enabled the employees of MCC Singapore to put aside their busy workload but also allowed foreign employees to celebrate the Mid-Autumn Festival with their family and friends in their home countries, as well as with colleagues in other overseas projects. The greetings and best wishes from home made everyone feel the warmth of their motherland. \"The green mountains that stretch from you to me share the same cloud and rain. The bright moon never separates two places in its embrace.\" Although the pandemic has temporarily prevented us from reuniting with our colleagues and loved ones in other countries, it has not ceased our communication or stopped us from caring for each other. I believe that the pandemic will soon be over, and we will meet again.\n\nMCC Singapore wishes you all the best,May you have a happy Mid-Autumn Festival and we wish you and your family good health.\n\nMay the pandemic recede for a clear autumn sky."
}