{
    "id": "2_10_2020",
    "photocount": 8,
    "title": "MCC Singapore Celebrates Mid-Autumn Festival Online",
    "titleCN": "明月何曾是两乡” 中冶新加坡云上庆中秋",
    "date": "October 2, 2020",
    "contentCN": "10月2日，继今年6月成功举办“云上端午 MCC‘粽’动员”活动，中冶新加坡在疫情下再次“云欢聚”，以“明月何曾是两乡”为主题，连线中国国内、新加坡、柬埔寨、印尼等地分会场，开展线上联欢，共庆传统佳节，弘扬中华文化。\n\n活动开始，中冶新加坡全体员工共同在线上观看了中冶建研院总经理朱建国及总院其他领导与同事们从北京发来的佳节慰问与嘱托。朱建国总经理在向中冶新加坡全体员工及家属致以节日祝福的同时，肯定了中冶新加坡近年来的发展和取得的成绩，面对当前疫情挑战，他强调要“坚信挑战与机遇并存，努力克服困难，寻求发展机遇”。\n\n伴着有望在数周后迎来解封第三阶段，放宽更多社会活动限制的好消息，中冶新加坡的办公室里挂起了灯笼，洋溢着浓浓的节日氛围。中冶新加坡的员工们从各自的工位、办公室、住家齐聚线上，各项目现场、柬埔寨及印尼项目部的员工们也备好了月饼等中国传统美食，在云上开展活动。2019“MCC Voice（中冶新加坡好声音）”冠军工人MOJUMDER BAKUL从位于新加坡北部的克兰芝工人宿舍分会场带来充满异域风情的孟加拉歌曲，开启了中冶新加坡的年度赛事“MCC Voice”。\n\n受疫情影响，今年参赛者们虽没有华丽的舞台和热情的观众，但也别有另一番乐趣。来自海外各个不同项目、不同国籍、文化背景的参赛者们在各自的镜头前当起“主播”，线上飙歌，除了耳熟能详的中文歌，还有别具韵味的印尼和孟加拉歌曲，让今年这疫情下的“云中秋”活动更加别具一格，令人难忘。除了精彩纷呈的“MCC Voice”，活动中间还穿插了中秋必不可少的传统活动“猜灯谜”等项目。\n\n多样的活动不仅让身处海外的中冶新加坡的员工们暂时放下紧张的工作，与国内亲友、以及其他国家项目部的兄弟姐妹可以在云端见面、共度中秋；一句句来自国内的问候与嘱托更是让大家感受到来自祖国大家庭的温暖和感动。“青山一道同云雨，明月何曾是两乡”，虽然疫情暂时阻隔了大家在中、新两地的见面，但我们的交流与守望始终没有中断。相信疫情很快就会散去，我们再重逢。中冶新加坡敬祝大家\n\n中秋快乐，阖家安康\n\n\n\n愿“疫”退九霄净，秋澄万景清",
    "content": "On 2 October, following the success of the \"Dragon Boat Festival on the Clouds\" event in June earlier this year, MCC Singapore once again gathered online for a virtual celebration of the Mid-Autumn Festival. Just as how \"the bright moon never separates two places in its embrace,\" the virtual celebration connected MCC employees in China, Singapore, Cambodia, and Indonesia as we come together to celebrate and join in on the festivities while simultaneously promoting Chinese culture.\n\nAs the event commenced, all employees of MCC Singapore jointly watched the festive greetings and messages from Zhu Jianguo, General Manager of MCC Central Research Institute of Building and Construction (MCC CRIBC), as well as from other leaders and colleagues of MCC CRIBC in Beijing. While extending holiday wishes to the employees and their families, General Manager Zhu Jianguo affirmed the development and achievements of MCC Singapore in recent years. In the face of the current pandemic and the challenges it poses to the company, he stressed the need to \"firmly believe that both challenges and opportunities co-exist, and strive to overcome these difficulties and seek opportunities for development.\"\n\nAlong with the good news expecting Singapore to enter the third phase of reopening in a few weeks' time and anticipating an easing of restrictions on social activities, lanterns were hung up in the offices of MCC Singapore, creating a festive atmosphere. The employees of MCC Singapore gathered online from their respective workstations, offices, and homes. The employees in various project sites located in Cambodia and Indonesia also prepared traditional Chinese festive delicacies such as moon cakes and carried out activities online. As the winner of last year's competition, Mojumder Bakul kicked off this year's annual company event, MCC Voice, with exotic Bengali songs sung from the worker's dormitories in Kranji.\n\nIn light of the current pandemic, there were no fancy stages or audiences cheering below the stage for this year's MCC Voice, but it was still fun in another kind of way. Participants from various overseas projects, of different nationalities and cultural backgrounds acted as 'anchor-men' in front of the camera, singing passionately. Besides the familiar Chinese songs, there were also Indonesian and Bengali songs showcasing their distinctive charms, making this year's virtual Mid-Autumn Festival celebration a special and memorable one. In addition to the spectacular MCC Voice event, the celebration was also interspersed with various traditional Chinese games such as the Lantern Riddles activity.\n\nThese various activities not only enabled the employees of MCC Singapore to put aside their busy workload but also allowed foreign employees to celebrate the Mid-Autumn Festival with their family and friends in their home countries, as well as with colleagues in other overseas projects. The greetings and best wishes from home made everyone feel the warmth of their motherland. \"The green mountains that stretch from you to me share the same cloud and rain. The bright moon never separates two places in its embrace.\" Although the pandemic has temporarily prevented us from reuniting with our colleagues and loved ones in other countries, it has not ceased our communication or stopped us from caring for each other. I believe that the pandemic will soon be over, and we will meet again.\n\nMCC Singapore wishes you all the best,May you have a happy Mid-Autumn Festival and we wish you and your family good health.\n\nMay the pandemic recede for a clear autumn sky."
}