{
    "id": "11_4_2020",
    "photocount": 1,
    "title": "Hong Xiaoyong, Chinese Ambassador to Singapore,Expresses Solicitude to Chinese workers of MCC Singapore in Video Conference",
    "titleCN": "中国驻新加坡大使洪小勇视频慰问中冶新加坡中国工友",
    "date": "April 4, 2020",
    "contentCN": "2020年4月11日早上十点，中国驻新加坡大使馆大使洪小勇、领事部参赞兼总领事邱元兴、经商处公使衔参赞钟曼英与中冶新加坡居住于榜鹅S11 PPT Lodge 1B劳工宿舍的4位中国工友代表进行了视频会议，该宿舍其他中国工友利用手机观看了整场会议。\n\n会议开始，钟公代表中国驻新加坡大使馆向居住于榜鹅S11 PPT Lodge 1B劳工宿舍的中国工友表示深切的慰问与关心，并鼓励工友们畅所欲言。随后，4位工友代表向洪大使、邱公参及钟公参对于榜鹅S11 PPT Lodge 1B劳工宿舍的中国工友们的关切表示感谢，并就宿舍现状包括饮食起居、宿舍管理水平、卫生环境、医疗物资供应及医疗服务保障等方面进行了说明，也表达了对疫情现状的担忧，以及希望新加坡政府相关部门在管理上做出的改善。会议中，洪大使、邱公参及钟公参与工友们进行了亲切的交流，倾听工友们的困难与需求，安抚不安情绪，并解答了工友们提出的一些问题。会议的最后，洪大使再次代表使馆向工友们致以诚挚的关怀，他表示疫情发生以来，祖国时刻牵挂海外公民的平安和健康。对于工友们的担忧，他将和大使馆同新加坡政府相关部门进行密切的沟通，积极发应大家的诉求。希望大家保持稳定好情绪，加强自身防疫，互帮互助，共渡难关，大使馆將竭力帮助工友们，解决各项诉求。\n\n",
    "content": "At 10am on 11 April 2020, Hong Xiaoyong, China’s Ambassador to Singapore, Qiu Yuanxing, Counsellor from the Consular Section of the Chinese Embassy in Singapore, Zhong Manying, Economic & Commercial Minister-Counsellor, and four Chinese workers’ representatives living in Punggol’s foreign worker dormitory, S11 PPT Lodge 1B, conducted a video conference while other Chinese workers view the whole conference on their mobile phones.\n\nAs the conference commences, Minister-Counselor Zhong Manying expressed her deepest sympathies and concern to the Chinese workers living in Punggol S11 PPT Lodge 1B, and encouraged them to speak freely. The four representatives expressed their gratitude to Ambassador Hong Xiaoyong, Counsellor Qiu Yuanxing, and Minister-Counselor Zhong Manying for their concern for the Chinese workers living in the Punggol dormitory. The representatives explained the current situation of the dormitory, including the standard of food and living, dormitory management, hygiene and sanitation, medical supplies and services, and also expressed their concerns regarding the current pandemic as well as the improvements in management which they hoped to see from the relevant departments of the Singapore government. During the conference, Ambassador Hong Xiaoyong, Counsellor Qiu Yuanxing, and Minister-Counselor Zhong Manying had a cordial exchange with the workers, listening to their difficulties and needs, helping to soothe their anxieties as well as answering the questions raised by the workers. At the end of the conference, Ambassador Hong Xiaoyong once again expressed his heartfelt concern for the workers on behalf of the Chinese Embassy in Singapore, assuring them that in this current pandemic, China is always concerned for the safety and health of Chinese citizens overseas. As for the concerns of the workers, Ambassador Hong Xiaoyong and the Embassy will closely communicate with the relevant departments of the Singapore government and actively respond to their demands. He hopes that everyone can maintain a positive outlook while also taking care of one’s own health and helping each other in these difficult times. The Chinese Embassy will do its best to help the workers and resolve their various concerns.\n\nMCC Singapore"
}