{ "id":"11_4_2020", 
"photocount": 1,
"title":"Hong Xiaoyong, Chinese Ambassador to Singapore,Expresses Solicitude to Chinese workers of MCC Singapore in Video Conference",
"date":"April 4, 2020",
"content":"At 10am on 11 April 2020, Hong Xiaoyong, China’s Ambassador to Singapore, Qiu Yuanxing, Counsellor from the Consular Section of the Chinese Embassy in Singapore, Zhong Manying, Economic & Commercial Minister-Counsellor, and four Chinese workers’ representatives living in Punggol’s foreign worker dormitory, S11 PPT Lodge 1B, conducted a video conference while other Chinese workers view the whole conference on their mobile phones.\n\nAs the conference commences, Minister-Counselor Zhong Manying expressed her deepest sympathies and concern to the Chinese workers living in Punggol S11 PPT Lodge 1B, and encouraged them to speak freely. The four representatives expressed their gratitude to Ambassador Hong Xiaoyong, Counsellor Qiu Yuanxing, and Minister-Counselor Zhong Manying for their concern for the Chinese workers living in the Punggol dormitory. The representatives explained the current situation of the dormitory, including the standard of food and living, dormitory management, hygiene and sanitation, medical supplies and services, and also expressed their concerns regarding the current pandemic as well as the improvements in management which they hoped to see from the relevant departments of the Singapore government. During the conference, Ambassador Hong Xiaoyong, Counsellor Qiu Yuanxing, and Minister-Counselor Zhong Manying had a cordial exchange with the workers, listening to their difficulties and needs, helping to soothe their anxieties as well as answering the questions raised by the workers. At the end of the conference, Ambassador Hong Xiaoyong once again expressed his heartfelt concern for the workers on behalf of the Chinese Embassy in Singapore, assuring them that in this current pandemic, China is always concerned for the safety and health of Chinese citizens overseas. As for the concerns of the workers, Ambassador Hong Xiaoyong and the Embassy will closely communicate with the relevant departments of the Singapore government and actively respond to their demands. He hopes that everyone can maintain a positive outlook while also taking care of one’s own health and helping each other in these difficult times. The Chinese Embassy will do its best to help the workers and resolve their various concerns.\n\nMCC Singapore"
}