{ "id":"27_6_2019", 
"photocount":3,
"title":"MCC Singapore & Sindeli Propertindo Abadi Real Estate Signed Joint Operation of Jakarta Living Star Projec",
"date":"JUNE 27, 2019",
"content":"At 10:00 am on June 27, MCC Singapore hosted a grand signing ceremony of the “Joint Operation Contract” in the star marketing center in Jakarta, which was witnessed by all sectors of society and numerous news media. The first phase of the project also broke ground on that day.\n\n6月27日上午10：00，中冶新加坡在社会各界及众多新闻媒体的共同见证下于雅加达之星营销中心举行了盛大的《项目联合运营合同》签约仪式，项目一期工程也于当日正式破土动工。\n\nThe ceremony was attended by Mr. Zhang Jian, CFO of MCC Singapore, and Mr. Wu Wei, President of Sindeli Propertindo Abadi Real Estate. Mr. Zhang Jian said: MCC Singapore will escort the project with the quality and strength of China's large enterprises, and will introduce the advanced real estate operation management system into the whole process of project development. In addition, MCC Singapore will also deepen its understanding of the essence of Singapore's urban life and the needs of Southeast Asian customers for many years to the level of products and services. Bringing different fashion, environmental protection and safe urban life experiences to the owners of Jakarta Living Star. Mr. Wu Wei mentioned: \"This cooperation is a strong alliance. The real estate business of MCC Group has chosen the Jakarta Living Star project for the first time in Indonesia, and is very optimistic about the location value and project quality of the project.\" Compared with other regions, the southeastern Jakarta region has mature urban facilities, convenient living, low housing prices, and even lower than some suburbs. It is an area that is very suitable for the masses. In addition, at the end of the year, the Light Rail Transit will start transport service by the end of the year, the third ring has begun construction, and the regional traffic network has been upgraded, which in turn has lifted the regional value. “It is foreseeable that after 3-5 years, the area will be completely renewed and become a superior city in Jakarta and a hot spot for human settlements and investment.\n\n参加此次仪式的有中冶新加坡CFO张建先生、新得利地产总裁吴畏先生等。张健先生表示：中冶新加坡此次将以中国大型企业的品质实力为项目保驾护航， 同时将把先进的房地产运营管理体系导入到项目开发全过程中。另外， 中冶新加坡也将把多年来对新加坡都市化生活的精髓和东南亚客户居住需求的深刻理解贯穿到产品、服务等层面。 为雅加达之星的业主带来不同的时尚、环保、安全的都市化生活感受。吴畏先生提到：“此次合作是强强联合。 中冶集团房地产业务首次进入印尼就选择雅加达之星项目，十分看好项目的区位价值和项目品质”。 与其他区域相比，东南雅加达地区，城市配套成熟，生活便捷，房价偏低，甚至低于部分郊区， 是十分适合大众阶层生活的区域。加之年底轻轨通车，第三环已开始建设，区域交通路网再升级，继而拉升区域价值“。 可以预见，3--5年后，该区域必将焕然一新，成为雅加达市区内兼具优越人居环境和投资爆发力的热点区域。\n\nAt the core of the region, JL RAYA BOGOR (PASAR REBO), Sindeli Propertindo Abadi Real Estate will work with MCC to create the Jakarta Living Star Project. Covering an area of 4.8 hectares and a total gross floor area of about 200,000 square meters, the project is a large-scale mid-to-high-end urban complex consisting of 6 apartments, characteristic commercial blocks and youth entrepreneurial bases.\n\n在该区域的核心地段---JL RAYA BOGOR(PASAR REBO)，新得利将与中冶集团联合打造雅加达之星项目。 项目占地4.8公顷，总建筑面积约20万平米，是由6栋公寓、特色商业街区和青年创业基地组成的大型中高档城市综合体。"
}
