{
    "id": "27_3_2020",
    "photocount": 7,
    "title": "Minister-Counselor Zhong Manying Inspects and Guides MCC Singapore’s Preventive Measures",
    "titleCN": "钟曼英公参调研指导中冶新加坡公司防疫工作",
    "date": "March 27, 2020",
    "contentCN": "3月27日，中国驻新加坡大使馆公使衔参赞钟曼英莅临中冶新加坡公司调研指导防疫工作。\n\n钟公参等一行两人抵达中冶新加坡公司，在公司董事及首席执行长谭志勇的指引下，体验了公司前台智能高效的红外远程测温仪及自助体温上报系统，随后进入会议室参会。疫情期间，为了减少人员接触，公司利用Zoom视频会议软件召开调研会议，仅钟公参等2人，及中冶新加坡公司谭志勇、张建、陈晓冬3人，相互间隔一米以上就坐于会议室内，另有公司17人各自位于内部独立办公室、项目现场及个人住家参与视频会议。\n\n会议一开始，谭志勇首先对钟公参在关键时期前来关心、指导中冶新加坡公司防疫工作表示欢迎与感谢，并简要介绍与会人员。之后，谭志勇继续向首次到访中冶新加坡公司总部的钟公参概述了公司自创立以来的发展历程，以及目前进行中的8个项目，并对近阶段疫情对公司现有人员的影响进行了说明。自新加坡出现首例确诊病例，公司严格依照政府的应对指示行事，961名员工中共有81人曾被要求居家隔离，15人因中国及马来西亚封锁政策滞留海外，无疑似或确诊病例。\n\n接着，谭志勇就公司展开的防疫工作进行了详细的汇报。今年春节期间，新冠病毒开始在新加坡蔓延，公司立即组建防疫工作领导小组，密切关注疫情发展，彻底贯彻新加坡政府下达的防疫对应指示，提出以疾病预防控制措施为指导的防疫思路，制定出科学有效、现实可行的防疫工作计划及应急预案，并第一时间充分购入防疫物资，做好物资管理和配置。目前，由于疫情的爆发，公司已全面实行错峰通勤、集体订餐、分组办公等升级防疫举措，将疫情对公司人员及业务的影响降到最低。\n\n听过谭志勇的防疫工作汇报，钟公参对中冶新加坡公司的工作给予了高度肯定，要求公司继续坚持做好防疫工作，现在新加坡形势并不乐观，不排除疫情进一步恶化的可能，要把困难想得多一点。另外，除了保证员工的安全，也要顾及到员工家属，员工家属安全了，才能保证员工确实的安全，做到全方面防控，8小时以内要注意，8小时以后也不能疏忽。特别是这几天新增的幼儿园感染群，要提醒有子女的员工多注意自身及家人的防护。同时，也要做好员工们的心理工作，支援有困难的员工，共同做好打持久战的心理准备。\n\n钟公参也就疫情对公司项目上的影响表示关心，谭志勇回应疫情对公司项目的影响在可控范围内，随着中国疫情好转复工复产，再加上新加坡方对于工期、索赔等问题上可商可量的态度，都对公司应对各种挑战起到了积极的作用。相较于新加坡，柬埔寨、印尼方面，由于当地政府对应不利，对于在建项目的影响较为明显，但公司已采取各项措施，有信心保证生产建设进度。\n\n钟公参说，今年是中新建交30周年，两国政府筹划的多场重要会议及活动都受到疫情影响而推迟，但两国交流不会就此停滞，正在积极探讨疫情过后，如何尽快恢复双方经贸往来，推动重大合作，携手向前。 钟公参在会议的最后感谢谭志勇及其引领的中冶新加坡公司对中资企业协会工作的大力支持，并期待日后进行更多往来交流，实现更多合作可能。\n\n会议结束后，钟公参等2人与谭志勇等3人合影留念，并约定待疫情得到控制，钟公参将再次访问中冶新加坡公司最新项目，万礼热带雨林公园北园项目现场。",
    "content": "On 27 March, Minister-Counselor Zhong Manying from the Embassy of China in Singapore visited MCC Singapore to inspect and guide the company's preventive measures.\n\nAccompanied by Mr Tan Zhiyong, Director and Chief Executive Officer (CEO) of MCC Singapore, Minister-Counselor Zhong experienced the smart and efficient infrared thermometer and self-help temperature monitoring system at the reception desk before entering the conference room for discussion and exchange. To reduce contact between personnel during the pandemic, MCC Singapore employs a video conferencing system for the discussion. In the meeting, there were only five people present in the main venue, including Minister-Counselor Zhong while the other 17 people joins the conference from their respective offices, project sites, and homes.\n\nAt the beginning of the meeting, Mr Tan Zhiyong expressed his welcome and gratitude to Minister-Counselor Zhong for taking the time to visit MCC Singapore as well as for her concern and guidance in the company's preventive measures during this pandemic period before briefly introducing the participants of the conference. Mr Tan Zhiyong then went on to give an overview of MCC Singapore's development since its inception and the progress of the ongoing projects, explaining the impact of the recent pandemic on the current employees of MCC Singapore and giving a detailed report on the company's preventive measures. When the pandemic began to spread in Singapore at the start of this year, MCC Singapore took immediate action to set up a team to lead the company's preventive measures, closely monitoring the pandemic situation in Singapore and thoroughly followed the regulations and preventive measures issued by the Singapore government. MCC Singapore has also put forth ideas regarding pandemic prevention based on the disease prevention and control measures, formulating scientific, effective, and feasible preventive measures and emergency plans. MCC Singapore also immediately purchased the resources needed for the preventive measures, and properly managed and allocated these resources. Due to the current outbreak, MCC Singapore has fully implemented the upgraded preventive measures such as staggered working hours, bulk ordering of meals, and split team arrangements to minimize the impact of the pandemic on the company's employees and business.\n\nAfter listing to Mr Tan Zhiyong's report on the preventive measures, Minister-Counselor Zhong affirmed the efforts of MCC Singapore and encouraged the company to maintain and continue such preventive measures especially in light of the worsening situation which requires us to be fully prepared. To fully ensure the safety of the employees, it is also necessary to consider the employees' families and their safety. Besides paying attention to the employees' situations during working hours, it is also important remain attentive of their situations beyond work hours. In particular, the latest cluster in kindergartens is a reminder to employees with children to be more careful in protecting themselves and their families from the virus. At the same time, it is also crucial to motivate and support employees who are having difficulties as we work together to prepare for a long battle with the pandemic.\n\nMinister-Counselor Zhong also expressed her concern regarding the impact of the pandemic on the company's current projects and Mr Tan Zhiyong responded that the pandemic's impact on the ongoing projects is under control. The improvement in China's situation, beginning the resumption of work and production, and Singapore's understanding of the difficulties regarding the construction period and claims, has served to motivate MCC Singapore in its response to various challenges.\n\nMinister-Counselor Zhong said that this year marks the 30th anniversary of the establishment of the diplomatic relations between China and Singapore, and several important meetings and activities planned by the two governments have been postponed due to the pandemic. However, the exchanges and communication between the two countries will not be deterred and the governments are actively discussing ways to resume economic and trade exchanges as soon as possible after the pandemic as we move forward together and create more opportunities for major cooperation between the two countries. At the end of the meeting, Minister-Counselor Zhong also expressed her hope that MCC Singapore would support the efforts of the China Enterprises Association (Singapore) and look forward to more exchanges and cooperation between Chinese and Singaporean enterprises in the future.\n\nAfter the conference, Minister-Counselor Zhong took a group photo with the participants and agreed to visit the Mandai Rainforest Park project again when the pandemic situation improves."
}