{ "id":"27_3_2020", 
"photocount": 1,
"title":"Minister-Counselor Zhong Manying Inspects and Guides MCC Singapore’s Preventive Measures",
"date":"March 27, 2020",
"content":"On 27 March, Minister-Counselor Zhong Manying from the Embassy of China in Singapore visited MCC Singapore to inspect and guide the company's preventive measures.\n\nAccompanied by Mr Tan Zhiyong, Director and Chief Executive Officer (CEO) of MCC Singapore, Minister-Counselor Zhong experienced the smart and efficient infrared thermometer and self-help temperature monitoring system at the reception desk before entering the conference room for discussion and exchange. To reduce contact between personnel during the pandemic, MCC Singapore employs a video conferencing system for the discussion. In the meeting, there were only five people present in the main venue, including Minister-Counselor Zhong while the other 17 people joins the conference from their respective offices, project sites, and homes.\n\nAt the beginning of the meeting, Mr Tan Zhiyong expressed his welcome and gratitude to Minister-Counselor Zhong for taking the time to visit MCC Singapore as well as for her concern and guidance in the company's preventive measures during this pandemic period before briefly introducing the participants of the conference. Mr Tan Zhiyong then went on to give an overview of MCC Singapore's development since its inception and the progress of the ongoing projects, explaining the impact of the recent pandemic on the current employees of MCC Singapore and giving a detailed report on the company's preventive measures. When the pandemic began to spread in Singapore at the start of this year, MCC Singapore took immediate action to set up a team to lead the company's preventive measures, closely monitoring the pandemic situation in Singapore and thoroughly followed the regulations and preventive measures issued by the Singapore government. MCC Singapore has also put forth ideas regarding pandemic prevention based on the disease prevention and control measures, formulating scientific, effective, and feasible preventive measures and emergency plans. MCC Singapore also immediately purchased the resources needed for the preventive measures, and properly managed and allocated these resources. Due to the current outbreak, MCC Singapore has fully implemented the upgraded preventive measures such as staggered working hours, bulk ordering of meals, and split team arrangements to minimize the impact of the pandemic on the company's employees and business.\n\nAfter listing to Mr Tan Zhiyong's report on the preventive measures, Minister-Counselor Zhong affirmed the efforts of MCC Singapore and encouraged the company to maintain and continue such preventive measures especially in light of the worsening situation which requires us to be fully prepared. To fully ensure the safety of the employees, it is also necessary to consider the employees' families and their safety. Besides paying attention to the employees' situations during working hours, it is also important remain attentive of their situations beyond work hours. In particular, the latest cluster in kindergartens is a reminder to employees with children to be more careful in protecting themselves and their families from the virus. At the same time, it is also crucial to motivate and support employees who are having difficulties as we work together to prepare for a long battle with the pandemic.\n\nMinister-Counselor Zhong also expressed her concern regarding the impact of the pandemic on the company's current projects and Mr Tan Zhiyong responded that the pandemic's impact on the ongoing projects is under control. The improvement in China's situation, beginning the resumption of work and production, and Singapore's understanding of the difficulties regarding the construction period and claims, has served to motivate MCC Singapore in its response to various challenges.\n\nMinister-Counselor Zhong said that this year marks the 30th anniversary of the establishment of the diplomatic relations between China and Singapore, and several important meetings and activities planned by the two governments have been postponed due to the pandemic. However, the exchanges and communication between the two countries will not be deterred and the governments are actively discussing ways to resume economic and trade exchanges as soon as possible after the pandemic as we move forward together and create more opportunities for major cooperation between the two countries. At the end of the meeting, Minister-Counselor Zhong also expressed her hope that MCC Singapore would support the efforts of the China Enterprises Association (Singapore) and look forward to more exchanges and cooperation between Chinese and Singaporean enterprises in the future.\n\nAfter the conference, Minister-Counselor Zhong took a group photo with the participants and agreed to visit the Mandai Rainforest Park project again when the pandemic situation improves.\n\nMCC Singapore"
}