{ "id":"20_8_2020", 
"photocount": 1,
"title":"MCC Singapore Officially Signed the Design & Build Contract for the Southern Part of the Mandai Tropical Rainforest Park Project",
"date":"August 20, 2020",
"content":"On 20 August 2020, MCC Singapore officially signed the design and build contract for the southern part of the Mandai Tropical Rainforest Park. The project covers an area of 6.88 hectares and is expected to be completed in early 2024.\n\nIn the first half of this year, Singapore’s construction industry has been hit hard by COVID-19, but MCC Singapore has bucked the trend. Since January, they have successively won the bid for the design and build contract for the northern part of the Mandai Tropical Rainforest Park, the EPC contract for the Short Street Cong Su Hotel project, as well as the design and build contract for the southern part of the Mandai Tropical Rainforest Park. MCC Singapore has maintained performance growth amidst the pandemic and has also actively promoted project development and the safe resumption of work and production after the pandemic.\n\nAs an ecotourism project that has attracted much industry attention in recent years, the design and construction challenges of the Mandai Tropical Rainforest Park are mainly to protect the existing ecological environment and sustainable development of the area, with the protection of the park's flora and fauna being the top priority in all aspects of design and construction, while ensuring the park's functionality as a theme park, meeting the needs of visitors. MCC Singapore’s commitment to high standards of innovative technology in planning and construction has led to a breakthrough in the theme park industry in terms of ecologically sustainable development, and this has also strengthened the prestigious MCC theme park brand, helping to create a new masterpiece.\n\nThe completed Mandai Tropical Rainforest Park will greatly stimulate the Singapore tourism market and extend the stay of tourists in Singapore, becoming a key component of Singapore's future tourism development plans. After completion, the park will serve as a sanctuary for endangered wild animal and plant species in Southeast Asia, becoming an important hub for natural ecological education and research in Asia. The Mandai Tropical Rainforest Park, together with Resorts World Sentosa, another project whose construction MCC Singapore had participated in, will serve as the two key landmarks for Singapore’s tourism industry, adding vitality to Singapore’s economic development.\n\nMCC Singapore"
}