{
    "id": "20_8_2020",
    "photocount": 1,
    "title": "MCC Singapore Officially Signed the Design & Build Contract for the Southern Part of the Mandai Tropical Rainforest Park Project",
    "titleCN": "中冶新加坡正式签订万礼热带雨林公园南区设计施工总承包合同",
    "date": "August 20, 2020",
    "contentCN": "2020年8月20日，中冶新加坡正式签订万礼热带雨林公园南区设计施工总承包合同，项目占地6.88公顷，预计将于2024年初竣工。\n\n今年上半年，新加坡建筑业因新冠疫情连续遭到重创，中冶新加坡却逆势而上，自一月份起连续中标万礼热带雨林公园北区设计及施工总承包项目、从肃街酒店工程总承包项目以及万礼热带雨林公园南区设计及施工总承包等多个项目，在疫情下保持业绩增长，并积极推动项目发展及疫后安全复工复产。\n\n万礼热带雨林公园作为近年广受业界关注的生态旅游项目，设计及施工难点主要体现在对该区域现有生态环境的保护及可持续发展，在所有设计及施工环节中，将园区内的动植物的保护放在首位，同时保证该园作为主题公园的功能性，满足游客体验需求。在这个项目中，中冶新加坡坚持高标准的创新科技规划设计与施工，在主题公园行业领域取得生态型发展的新突破，也为享誉盛名的MCC主题公园品牌锦上添花，打造出新的佳作。\n\n全面完工的万礼生态园将大力刺激新加坡旅游市场，延长游客到访新加坡的逗留时间，是新加坡旅游业未来发展计划的重要项目。建成后，该园将守护东南亚濒危珍稀野生动植物，成为亚洲自然生态教育和研究的重要枢纽，与中冶新加坡参与建设的圣淘沙名胜世界度假区共同成为新加坡旅游业的两张国家名片，为新加坡的经济发展增添活力。",
    "content": "On 20 August 2020, MCC Singapore officially signed the design and build contract for the southern part of the Mandai Tropical Rainforest Park. The project covers an area of 6.88 hectares and is expected to be completed in early 2024.\n\nIn the first half of this year, Singapore’s construction industry has been hit hard by COVID-19, but MCC Singapore has bucked the trend. Since January, they have successively won the bid for the design and build contract for the northern part of the Mandai Tropical Rainforest Park, the EPC contract for the Short Street Cong Su Hotel project, as well as the design and build contract for the southern part of the Mandai Tropical Rainforest Park. MCC Singapore has maintained performance growth amidst the pandemic and has also actively promoted project development and the safe resumption of work and production after the pandemic.\n\nAs an ecotourism project that has attracted much industry attention in recent years, the design and construction challenges of the Mandai Tropical Rainforest Park are mainly to protect the existing ecological environment and sustainable development of the area, with the protection of the park's flora and fauna being the top priority in all aspects of design and construction, while ensuring the park's functionality as a theme park, meeting the needs of visitors. MCC Singapore’s commitment to high standards of innovative technology in planning and construction has led to a breakthrough in the theme park industry in terms of ecologically sustainable development, and this has also strengthened the prestigious MCC theme park brand, helping to create a new masterpiece.\n\nThe completed Mandai Tropical Rainforest Park will greatly stimulate the Singapore tourism market and extend the stay of tourists in Singapore, becoming a key component of Singapore's future tourism development plans. After completion, the park will serve as a sanctuary for endangered wild animal and plant species in Southeast Asia, becoming an important hub for natural ecological education and research in Asia. The Mandai Tropical Rainforest Park, together with Resorts World Sentosa, another project whose construction MCC Singapore had participated in, will serve as the two key landmarks for Singapore’s tourism industry, adding vitality to Singapore’s economic development.\n\nMCC Singapore"
}