{ "id":"16_8_2019", 
"photocount":7,
"title":"MCC Singapore Participated in Singapore Regional Business Forum and the first Singapore Regional Infrastructure Summit",
"date":"AUGUST 16, 2019",
"content":"From August 15th to 16th, MCC Singapore participated in the 5th Singapore and Regional Business Forum hosted by the Singapore Business Federation (SBF) and the first Singapore and Regional Infrastructure Summit. At the meeting, the strategic cooperation memorandum of \"Cambodia-China Comprehensive Investment Development Pilot Zone and Dara Sakor Tourism Resort Zone\" was signed with Singapore Business Federation and Union group. From then on, the three countries will cooperate to develop the pilot zone, strengthen local infrastructure construction, improve town planning, enhance interoperability, promote local economic development and contribute to the traditional friendship between Cambodia and China.\n\n8月15-16日，中冶新加坡参加了由新加坡工商联合总会（SBF）主办的第五届新加坡暨区域商务论坛及首届新加坡暨区域基础设施峰会， 并且在会上与新加坡工商联合总会及优联集团签署了 “柬中综合投资开发试验区暨七星海旅游度假特区” 战略合作备忘录。 自此，三方将合作开发试验区，加强当地基础设施建设，改善城镇规划，增强互通性，促进当地经济发展，并为柬中新传统友谊作出贡献。\n\nThe summit is held at The ritz-carlton, Millenia Singapore.The two-day event will have in-depth discussions on the themes of \"strengthening business cooperation to enhance regional connectivity\" and \"exploring regional infrastructure opportunities\".\n\n此次峰会在新加坡丽思卡尔顿美年酒店（The Ritz-Carlton, Millenia Singapore）隆重召开。 为期两天的盛会将分别就“加强商务合作增进区域互联互通”和“ 开拓区域基础设施商机”为主题进行深入探讨。\n\nIn this summit, Mr. Tan Zhiyong, CEO of MCC Singapore, also made a speech. He mainly shared the practical experience and challenging of China-Singapore joint venture to carry out business cooperation in the third-party market. MCC Singapore, as the overseas branch of MCC group, has been exploring the development mode in the surrounding countries in recent years, and participated in the Sky Villa luxury apartment project in Cambodia with the project management and project general contracting mode. Participated in the Living Star project in Jakarta, Indonesia in the mode of joint development of local enterprises. At present, the company focuses on the development of Cambodia and China comprehensive investment development pilot zone: Dara Sakor, which is also an exemplary project of China-Singapore joint development to the third market.\n\n中冶新加坡公司CEO总裁谭志勇先生参与了论坛讨论，他主要分享了中新联合走出去在第三方市场开展商务合作的实践经验和面临的挑战。 中冶新加坡作为中冶集团的海外分公司，近年也一直在探索在周边国家市场的发展模式，以项目管理和工程总承包模式参与了柬埔寨 Sky Villa 豪华公寓项目； 以当地企业联合开发的模式参与了印度尼西亚雅加达的 Living Star 项目。目前公司重点开发的柬埔寨柬中综合投资开发试验区即七星海旅游度假特区项目， 也是中冶新加坡努力打造的中新联合到第三方市场发展的示范型项目。\n\nIn addition, Ms. Li Yanmei, Senior Vice President of MCC urban planning department, also made a speech at the meeting to introduce the Dara Sakor project in Cambodia in detail. The overall plan of the project has been completed, and the four major industrial directions of the plan are manufacturing and logistics, tourism, green business technology and health and fitness. Infrastructure construction and resort construction are under way.\n\n此外，中冶新加坡城市规划部高级副总裁李艳梅女士在会上做主题演讲，详细具体地介绍了柬埔寨七星海项目。 该项目总体规划已经完成，规划的四大产业方向为制造业与物流业、 旅游度假、绿色商业科技和康体养生。 目前正在进行基础设施建设和度假区建设。\n\nThe guest speaker of the forum, Mr. Hong Xiaoyong, Ambassador of China to Singapore, affirmed the positive and effective role played by the Singapore and Regional Business Forum in promoting the “the Belt and Road” initiative in the region. The remarkable achievements of the “the Belt and Road” cooperation also expressed the Chinese government's vision of a good relationship between political mutual trust and economic integration among the countries of Asia.\n\n本次论坛的特邀演讲嘉宾中国驻新加坡特命全权大使洪小勇先生肯定了新加坡暨区域商务论坛在促进本地区国家共建“一带一路”的过程中所发挥的积极有效的作用， 回顾了这6年来“ 一带一路”合作所取得的显著成果，同时也表达了中国政府对于亚西安各国之间政治互信，经济互融良好关系展望。\n\nMore than 70 heavyweight speakers and panellists from around the world share their experience and expertise in their respective fields with over 800 new envoys, top business leaders, and senior government officials from more than 50 countries and regions.\n\n超过70位来自全球的重量级演讲及讨论嘉宾与来自50多个国家和地区逾800位驻新使节、顶级商业领袖、高级政府官员等分享在各自领域的经验和专业知识。\n\n"
}
