{ "id":"30_9_2019", 
"photocount": 1,
"title":"The Alps Residences (ALPS) Private Condominium Project Obtains Completion Permit",
"date":"September 30, 2020",
"content":"On 30 September 2019, the day when China celebrates the eve of the 70th anniversary of the People's Republic of China, MCC Singapore also received the completion permit for the Alps Residences (ALPS) project after 110 days of waiting and challenges posed by the Building and Construction Authority of Singapore (BCA). There is an old Chinese proverb that says: \"Honing gives a sharp edge to a sword, and the fragrance of plum blossom comes from the bitter cold.\" The taste of the harvest is sweet with laughter and tears.\n\nThe ALPS private condominium project is developed by MCC Land (Tampines) Pte Ltd and constructed by China Jingye Construction Engineering (Singapore) Pte Ltd.\n\nThe project is located in Tampines, in the eastern part of Singapore, about 10 minutes' drive from Tampines MRT Station, Tampines Mall, Tampines 1, and Century Plaza. It is about five minutes' drive from Tampines Expressway (TPE) and Pan Island Expressway (PIE). Inspired by the Alps, the Alps Residences features nine residential blocks with undulating heights that are reminiscent of the iconic silhouette of the Alps mountain range in Europe. Public facilities such as swimming pools and pavilions are also built in the mold of the Swiss mountain cabins, which are expected to become a landmark for the area in the future.\n\nWith a total contract sum of S$115,000,000, a total construction floor area of 16,660.40 square meters, a total floor area of 43,850 square meters, and a 2.8 plot ratio, this 99-year leasehold project consists of 626 units in nine buildings, two-thirds of which are two- to three-bedroom apartments with an area ranging from 41 to 231 square meters. The condominium offers amenities including a barbeque area, gym, children's pool, standard pool, two convenience stores, reading room, and recreation area. \n\nAfter 1,081 days of trials and tribulations, the project team remains dedicated, cooperative, enterprising, and pragmatic, taking it as their mission to complete the project on time and with quality. None of the members gave up despite the various challenges encountered in the process, resulting in a stellar achievement with the ALPS project recording a score of 100 for the structure and 94.93 out of 100 for the total score.\n\nFollowing this achievement, the ALPS project team will try their best to cooperate with the colleagues in the customer service department to complete the transfer of unit and follow up on tenant feedback, as well as continue to produce more commendable results in the future.\n\n"}