{"id":"23_6_2020", 
"photocount": 1,
"title":"MCC Singapore’s \"Dragon Boat Festival on Cloud\" Attracts CCTV’s Attention",
"date":"June 23, 2020",
"content":"As the traditional Chinese Dragon Boat Festival approaches on June 23, Singapore also ushered in the second phase of Singapore’s reopening after a two-month gap. At the same time, MCC Singapore also received news that several of its construction projects were ready for resumption. Taking this opportunity, MCC Singapore organized a \"Dragon Boat Festival on the Clouds\" event, which brought all staff and some of their families online to celebrate the festival. On the one hand, the event was a way to promote traditional Chinese culture overseas and strengthen communication between staff and their families at home; on the other hand, it was a way to mobilize MCC Singapore employees before the full resumption of work. This event attracted the attention of China Central Television's correspondent station in Singapore., which filmed the whole event and interviewed Tan Zhiyong, Deputy General Manager and Chief Executive Officer of MCC Singapore as well as other relevant personnel.\n\nIn the afternoon, some of the staff who had already resumed work wrapped up the dumplings in the company. The fragrant dumpling leaves, wrapped in sweet glutinous rice, red beans, and dates, were sent to the project site and workers' quarters as a greeting to all the company's staff, with CCTV cameras following the whole process to record the warm scene.\n\nOther MCC Singapore employees who have resumed work stayed in their respective offices and continued to work intensively, making full preparations for the resumption of work for the coming projects. CCTV also entered the office of Productivity and Technology Innovation and interviewed Engineer Wang Mingda, the person-in-charge of the new theme park design and EPC project, Mandai Tropical Rainforest Park.\n\nAt 5:30 pm, the connection on the cloud began, with 300 cloud ports connected to the main conference room located in MCC Singapore. These connections were made from various corners of the project site, Singapore home office staff's families, workers' dormitories, staff's families in their home countries, and project departments in other countries such as Cambodia and Indonesia. Tan Zhiyong expressed his deepest sympathy and concern to each and every staff member who participated in the video conference and conveyed his sincere gratitude to the families for their contribution to the projects. In addition, he also mobilized the employees to boost their morale for the upcoming project resumption. \n\nDuring this event, each sub-venue introduced its situation. The video connection with the Mandai Tropical Rainforest Park project allowed everyone to see the environment of the rainforest and the challenges faced by the project; the steel structure factory and workers' dormitory were also lively, with multiple points of connectivity to the main conference room, Bangladeshi workers wear their traditional costumes to join in the activities and have fun with the Chinese workers, and the Chinese workers' representatives adapted and sang the song \"China Jingye, you are my pride\" for everyone. In addition, overseas Chinese employees and employees of other nationalities also dedicated themselves to explaining the different Dragon Boat Festival customs and how they felt about eating dumplings for the first time. Colleagues from as far away as Cambodia demonstrated different Cambodian dumplings and festive customs.\n\nMany Singaporean employees working from home connected with their families during this event, and other employees of MCC Singapore who are working in a foreign country had a hard time holding back their tears. The event especially helped to connect Hubei staff with their families, who have a lot of concerns in this particular year.\n\nAt the end of the event, all the participants took out paper and pen and wrote down \"good health for all, MCC Singapore, keep going!\" in their own languages. More than 300 good wishes formed a beautiful scroll together, praying that the epidemic will dissipate as soon as possible, and we can reunite once again to contribute to MCC Singapore.\n\nRelevant reports will be broadcasted on CCTV news programs during the Dragon Boat Festival.\n\nChen Luning\nMCC Singapore"
}