{
    "id": "23_6_2020",
    "photocount": 14,
    "author": "Chen Luning",
    "title": "MCC Singapore’s \"Dragon Boat Festival on Cloud\" Attracts CCTV’s Attention",
    "titleCN": "中冶新加坡“云上端午，MCC粽动员”活动吸引央视关注",
    "date": "June 23, 2020",
    "contentCN": "6月23日，中国传统节日端午节将近，新加坡也在时隔两个月后，迎来了第二阶段的解封。同时，公司的几个建设项目，也陆续接到可以复工的消息。借此机会，中冶新加坡举办了“云上端午，MCC“粽”动员”活动，全体员工及部分家属共同在线，共迎佳节。此次活动一方面是在海外对中华传统文化进行发扬传承，加强员工与国内亲人的交流；另一方面是在新加坡项目复工来临之际的一次总动员。此次活动得到了中国中央电视台驻新加坡记者站的关注，并全程进行跟踪拍摄，并对中冶新加坡副总经理兼首席执行官谭志勇等相关人员进行了现场采访。\n\n当天下午，部分已经复工的公司员工在公司包起了粽子。清香的粽叶包裹着香甜的糯米、红豆和红枣，寄托着对公司全体员工的祝福，送到了项目现场和工人宿舍，央视镜头全程跟拍，记录下了这温馨的一幕。\n\n其他已经复工的中冶新加坡员工留在各自办公区，继续紧锣密鼓地工作，为接下来各项目的复工做着充分准备，央视的镜头也走入了生产力及技术创新的办公室，采访了不久前刚刚中标的全新主题公园设计及总承包项目万礼热带雨林公园的负责人王明达工程师。\n\n下午5点半，云上端午的连线活动开始，300个云端端口同时接入位于中冶新加坡会议室的主会场，这些连线分别来自项目现场、新加坡居家办公员工家庭、工人宿舍、员工国内家属家庭、柬埔寨及印尼等其他国家的项目部等多个角落。谭志勇对每一位视频参会的员工们表示深切慰问及关怀，对家属们的付出表示诚挚感谢。此外，也为中冶新加坡即将迎来的项目复工做了总动员，鼓舞士气。 \n\n在云上端午的活动过程中，各个分会场分别介绍了自己的情况。万礼热带雨林公园项目的连线让所有人在云端看到了热带雨林的环境和项目面临的各项挑战；钢结构工厂及工人宿舍更是热闹，多点连线进入会场，孟加拉工人们穿上了自己的传统服饰加入活动，与中国工人同乐，中国工人代表还专门改编歌曲《中国京冶，你是我的骄傲》为大家演唱。此外，海外华人与其他民族的员工也专门为大家讲解了不同的端午习俗，以及他们第一次吃粽子的感受。远在柬埔寨的同事们为大家展示不一样的柬埔寨粽子和过节习俗。\n\n多位居家办公的新加坡员工在这次云上端午的活动中，与国内的家人连线，工作原因再加上疫情阻隔，许多在异乡工作的中冶新加坡员工都跟着一起红了眼眶。活动特别连线了湖北籍员工和他们的家人，在这样一个特殊的年份里，他们有着更多牵挂。\n\n活动最后，云端的全体参与者拿出纸笔，用各自的语言写下“端午安康，中冶加油”展示在镜头。300多个美好祝愿构成一幅美好画卷，共同祈愿疫情早日散去，再次重聚，为中冶贡献力量。\n\n届时，相关报道将于端午节期间在央视新闻栏目中进行播出。",
    "content": "As the traditional Chinese Dragon Boat Festival approaches on June 23, Singapore also ushered in the second phase of Singapore’s reopening after a two-month gap. At the same time, MCC Singapore also received news that several of its construction projects were ready for resumption. Taking this opportunity, MCC Singapore organized a \"Dragon Boat Festival on the Clouds\" event, which brought all staff and some of their families online to celebrate the festival. On the one hand, the event was a way to promote traditional Chinese culture overseas and strengthen communication between staff and their families at home; on the other hand, it was a way to mobilize MCC Singapore employees before the full resumption of work. This event attracted the attention of China Central Television's correspondent station in Singapore., which filmed the whole event and interviewed Tan Zhiyong, Deputy General Manager and Chief Executive Officer of MCC Singapore as well as other relevant personnel.\n\nIn the afternoon, some of the staff who had already resumed work wrapped up the dumplings in the company. The fragrant dumpling leaves, wrapped in sweet glutinous rice, red beans, and dates, were sent to the project site and workers' quarters as a greeting to all the company's staff, with CCTV cameras following the whole process to record the warm scene.\n\nOther MCC Singapore employees who have resumed work stayed in their respective offices and continued to work intensively, making full preparations for the resumption of work for the coming projects. CCTV also entered the office of Productivity and Technology Innovation and interviewed Engineer Wang Mingda, the person-in-charge of the new theme park design and EPC project, Mandai Tropical Rainforest Park.\n\nAt 5:30 pm, the connection on the cloud began, with 300 cloud ports connected to the main conference room located in MCC Singapore. These connections were made from various corners of the project site, Singapore home office staff's families, workers' dormitories, staff's families in their home countries, and project departments in other countries such as Cambodia and Indonesia. Tan Zhiyong expressed his deepest sympathy and concern to each and every staff member who participated in the video conference and conveyed his sincere gratitude to the families for their contribution to the projects. In addition, he also mobilized the employees to boost their morale for the upcoming project resumption. \n\nDuring this event, each sub-venue introduced its situation. The video connection with the Mandai Tropical Rainforest Park project allowed everyone to see the environment of the rainforest and the challenges faced by the project; the steel structure factory and workers' dormitory were also lively, with multiple points of connectivity to the main conference room, Bangladeshi workers wear their traditional costumes to join in the activities and have fun with the Chinese workers, and the Chinese workers' representatives adapted and sang the song \"China Jingye, you are my pride\" for everyone. In addition, overseas Chinese employees and employees of other nationalities also dedicated themselves to explaining the different Dragon Boat Festival customs and how they felt about eating dumplings for the first time. Colleagues from as far away as Cambodia demonstrated different Cambodian dumplings and festive customs.\n\nMany Singaporean employees working from home connected with their families during this event, and other employees of MCC Singapore who are working in a foreign country had a hard time holding back their tears. The event especially helped to connect Hubei staff with their families, who have a lot of concerns in this particular year.\n\nAt the end of the event, all the participants took out paper and pen and wrote down \"good health for all, MCC Singapore, keep going!\" in their own languages. More than 300 good wishes formed a beautiful scroll together, praying that the epidemic will dissipate as soon as possible, and we can reunite once again to contribute to MCC Singapore.\n\nRelevant reports will be broadcasted on CCTV news programs during the Dragon Boat Festival.\n\nChen Luning\nMCC Singapore"
}