{ "id":"23_8_2019", 
"photocount":6,
"title":"MCC Singapore Held A Sky Villa Press Conference in Phnom Penh",
"date":"August 23, 2019",
"content":"MCC Singapore held a press conference on the morning of August 23 for Sky Villa to introduce the brand and project. Many guests and media reporters were invited to attend the event.\n\nSky Villa项目于8月23日上午举行记者发布会，进行品牌和项目介绍。邀请了众多嘉宾及媒体记者参加。\n\nSky Villa is expected to be completed in March 2020, and the 140-meter-tall twin towers will be one of Cambodia's top 10 skyscrapers. The golden and resplendent Sky Villa will also become a symbol of the prosperity of Cambodia. Its elegant appearance and stately interior reflect the prosperity of Cambodia in the new century.\n\nSky Villa预计在2020年3月竣工，这高达140米的双峰塔将被列入柬埔寨十大摩天高楼之一。 外观金碧辉煌的Sky Villa也会成为柬埔寨繁荣经济的象征性建筑高楼，它高雅的外观和堂皇的内饰都反映新世纪柬埔寨的繁华。\n\nThe project is located at the intersection of Sihanoukville and 163 on the southeast side of the Olympic Stadium in Phnom Penh, Cambodia, the location is excellent. The project consists of two 35-story towers (A and B buildings) with a height of 138.6 meters and a 15-story building (C building) with a height of 63.6 meters and a total construction area of 120,000 square meters, the construction period is 22 months. The project plan is a large-scale five-star luxury house with a large-sized design, each household area is between 300 square meters and 450 square meters.\n\n该项目位于柬埔寨金边奥林匹克运动场东南侧西哈努克大道和163路的交叉口，地理位置十分优越。 项目包括两栋35层塔楼（A、B栋）高138.6米和1栋15层的楼 (C栋）高63.6米，总建筑面积为12万平方米，工期22个月。 项目规划是大面积五星级豪宅，采用超大户型设计，每户面积在300平方米至450平方米之间。\n\n Mr. Tan Zhiyong, CEO of MCC Singapore, also addressed the meeting than 60 countries and regions, the Group's business is dominated by metal mining, while other businesses cover construction, real estate development, equipment manufacturing, etc. MCC Singapore has a history of more than 25 years in Singapore, the business includes real estate development and projects management, urban planning and construction engineering, etc. Over the years, MCC Singapore has contributed a number of landmarks to Singapore's world-famous skyline, including the Singapore Port Authority Terminal Warehouse, Singapore Expo Centre, and Universal Studios Singapore and more.\" \n\n中冶新加坡公司首席执行官谭志勇先生也在此次会议中致辞：“中国中冶是中国国有资产管理委员会管理的重点国有企业之一， 2019年集团在世界500强企业荣登112位排名，业务遍及60多个国家和地区。集团业务以金属矿业为主，同时其它业务涵盖建筑工程、房地产开发、装备制造等。 中冶新加坡在新加坡已有超过25年的发展历史，业务包括房地产开发、项目管理、城市规划及建筑工程等业务。 中冶新加坡多年来为新加坡世界闻名的天际线贡献了不少地标，其中有新加坡港务局码头仓库、新加坡博览中心、新加坡环球影城等等。”\n\n Cambodia is one of the key countries in our overseas business expansion strategy. This time we and Greatview invested in Sky Villa’s developer lineup, and we are committed to building a top luxury apartment project that is not only the most advanced in Phnom Penh, but also add a dazzling landmark for this the rapidly developing city skyline. We and Greatview have jointly developed TRE Residences and the large-scale integrated project The POIZ and The POIZ Centre on the edge of the city centre in Singapore. Through this Sky Villa cooperation, we also hope to bring the new concept of home and design to Phnom Penh, inject new sparks into the real estate market, and take it to the next level.\" \n\n“柬埔寨是我们海外业务扩充策略的重点国家之一。这次我们和豪景投资加入了Sky Villa的发展商阵容，致力打造一个不只是金边市最为顶尖的奢华高档公寓项目， 也为这迅速发展的城市天际线增添一个全球瞩目的炫丽地标。 我们和豪景投资在新加坡也曾联手开发了位于市中心边缘的公寓项目TRE Residences和大型综合项目博雅居及博雅中心。 通过这次Sky Villa的合作，我们也希望把新颖的居家概念和设计理念带入金边，为这里的房地产市场注入新火花，更上一层楼。\""
}