{
    "id": "11_10_2019",
    "photocount": 3,
    "title": "MCC Land Wins the Bid for Canberra Link Executive Condominium Project",
    "titleCN": "坎贝拉连路执行共管公寓项目中标",
    "date": "October 11, 2019",
    "contentCN": "2019年10月11日，中冶置业新加坡成功中标坎贝拉连路执行共管公寓项目，该项目所属区域为新加坡第27区的三巴旺区，位于新加坡北部，土地面积16690平方米，容积率2.3，属于99年地契，估计可兴建450个住宅单位，项目建设周期不超过5年，楼层限制高度介于海平面以上45米至55米。\n\n市区重建局在2014年城市总体规划的蓝图中提出计划在三巴旺区域注入新设施与新空间，以满足社区发展的愿景，逐步把三巴旺打造成有生命力与活力的市镇，以满足居民的多方面需求。该地块附近几乎仍有空置地皮，但都在政府规划范围内，其中拟建三所教育机构，剩余空置地块大部分为高层住宅，其中紧靠竞标项目东面的地块以558新币的尺价于去年9月售出，预计建造550个住宅单位。\n\n最让中冶人可贺的是，新加坡公司标价仅仅领先第二标每平方尺0.95新元，充分显示我司对市场趋势的理解力与判断力。这是我公司在北部拿到的第五块土地，中冶建研新加坡将一如既往以“创造无限生活”为使命，努力打造精品公寓，共同建设新加坡美好花园。",
    "content": "On 11 October 2019, MCC Land successfully wins the tender for the Canberra Link Executive Condominium project. The project is located in the northern part of Singapore, in Sembawang District, District 27, with a land area of 16,690 square meters, 2.3 plot ratio, a 99-year land lease, with an estimated number of 450 residential units that can be built. The construction period of the project does not exceed five years, with the building height between 45 meters and 55 meters above sea level.\n\nLocation of the Canberra Link EC project\n\nThe Urban Redevelopment Authority (URA), in its blueprint for Master Plan 2014, proposed plans to create new facilities and spaces in the Sembawang District to meet the vision of community development and gradually transform Sembawang into a vibrant town to meet the needs of its residents. There are still many vacant lots in the vicinity of the site, but they are within the Singapore Government's planning parameters, in which three educational institutions are proposed while the remaining vacant lots are mostly high-rise residential properties. The plot to the east of the Canberra Link EC project site was sold in September 2019 at S$558 per square foot and 550 residential units are expected to be built.\n\nIt is also commendable that our company's bid exceeded the second-highest bid by a mere $0.95 per square feet, which demonstrated the company's astute judgment and understanding of the market. The EC site at Canberra Link is the fifth site that the company has acquired in the northern part of Singapore. As always, MCC Singapore will continue to fulfill our mission \"Transforming Lives, Inspiring Society,\" creating more beautiful homes for the urban city of Singapore.\n\nMCC Singapore\nXin Yan"
}